RedditClone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "Season restarts despite COVID & SARS20"], ["updated_at", "2020-11-09 22:25:31.426335"], ["id", 2]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)