RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Anything pertaining to or regarding video games."], ["updated_at", "2020-11-09 19:15:08.341126"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 3]]
---
    def destroy
        @sub = Sub.find_by(id: params[:id])
        @sub.delete