RedditClone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---

        <% Sub.all.each do |subs| %>